benchmarks/results/postgis-20260920T083813Z.txt
PostGIS benchmark
timestamp_utc=20260920T083813Z
database=mapdb
scale=100000
clients=8
duration_seconds=30

## PostGIS version
POSTGIS="3.4.3 e365945" [EXTENSION] PGSQL="160" GEOS="3.9.0-CAPI-1.16.2" PROJ="7.2.1 NETWORK_ENABLED=OFF URL_ENDPOINT=https://cdn.proj.org USER_WRITABLE_DIRECTORY=/var/lib/postgresql/.local/share/proj DATABASE_PATH=/usr/share/proj/proj.db" LIBXML="2.9.10" LIBJSON="0.15" LIBPROTOBUF="1.3.3" WAGYU="0.5.0 (Internal)" TOPOLOGY

## Bulk insert setup and throughput
DROP SCHEMA
CREATE SCHEMA
CREATE TABLE
CREATE TABLE
CREATE TABLE
[...]
INSERT 0 100000
INSERT 0 100000
INSERT 0 100000
INSERT 0 1000
rows_inserted=301000
elapsed_seconds=1.181
rows_per_second=254868.76
CREATE INDEX
CREATE INDEX
CREATE INDEX
[...]
ANALYZE
ANALYZE
ANALYZE
[...]

## Spatial operator plans
### ST_DWithin
                                                               QUERY PLAN                                                                
-----------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=69.67..69.68 rows=1 width=8) (actual time=0.228..0.229 rows=1 loops=1)
   Buffers: shared hit=5 read=7
   ->  Bitmap Heap Scan on points  (cost=4.44..69.65 rows=10 width=0) (actual time=0.197..0.224 rows=5 loops=1)
         Filter: st_dwithin(geom, '0101000020E610000000000000000000000000000000000000'::geometry, '1'::double precision)
         Heap Blocks: exact=5
         Buffers: shared hit=5 read=7
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..4.44 rows=4 width=0) (actual time=0.126..0.126 rows=5 loops=1)
               Index Cond: (geom && st_expand('0101000020E610000000000000000000000000000000000000'::geometry, '1'::double precision))
               Buffers: shared read=7
 Planning:
   Buffers: shared hit=196
 Planning Time: 11.790 ms
 Execution Time: 0.351 ms
(13 rows)

### ST_Intersects
                                                                                                                     QUERY PLAN                                                                                                                      
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=7756.95..7756.96 rows=1 width=8) (actual time=1.590..1.591 rows=1 loops=1)
   Buffers: shared hit=419 read=10
   ->  Bitmap Heap Scan on points  (cost=16.59..7755.56 rows=556 width=0) (actual time=0.325..1.550 rows=574 loops=1)
         Filter: st_intersects(geom, '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
         Heap Blocks: exact=412
         Buffers: shared hit=419 read=10
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..16.45 rows=556 width=0) (actual time=0.259..0.260 rows=574 loops=1)
               Index Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
               Buffers: shared hit=7 read=10
 Planning:
   Buffers: shared hit=188
 Planning Time: 9.195 ms
 Execution Time: 1.706 ms
(13 rows)

### Bounding box
                                                                                                                     QUERY PLAN                                                                                                                     
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=808.34..808.35 rows=1 width=8) (actual time=1.015..1.017 rows=1 loops=1)
   Buffers: shared hit=429
   ->  Bitmap Heap Scan on points  (cost=16.59..806.95 rows=556 width=0) (actual time=0.229..0.979 rows=574 loops=1)
         Recheck Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
         Heap Blocks: exact=412
         Buffers: shared hit=429
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..16.45 rows=556 width=0) (actual time=0.165..0.166 rows=574 loops=1)
               Index Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
               Buffers: shared hit=17
 Planning:
   Buffers: shared hit=116
 Planning Time: 9.860 ms
 Execution Time: 1.127 ms
(13 rows)


## Concurrent query benchmark
CREATE TABLE
INSERT 0 1
pgbench (16.4 (Debian 16.4-1.pgdg110+2))
transaction type: /tmp/pgbench-dwithin.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 56804
number of failed transactions: 0 (0.000%)
latency average = 4.220 ms
initial connection time = 44.048 ms
tps = 1895.955171 (without initial connection time)
### dwithin latency percentiles